Revit 2024 API
Application.CurrentRevitServerAccelerator Property
 Current Revit Server accelerator.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string CurrentRevitServerAccelerator { get; set; }
Visual Basic
Public Property CurrentRevitServerAccelerator As String
	Get
	Set
Visual C++
public:
property String^ CurrentRevitServerAccelerator {
	String^ get ();
	void set (String^ value);
}
Remarks
 Revit connects with Revit Server hosts via current Revit Server accelerator. If current Revit Server accelerator is not set, this will be an empty string.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The server name can not be used to construct a well formed Uri string.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: When setting the value, Revit failed to write current Revit Server accelerator to the user environment.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace